а=10
# Лабораторная работа №7 задание 1, Голоднюк Артем
a1 = {11, 33, 44, 55, 11, 44}
a2 = a1.union()
print(a2)

# Лабораторная работа №7 задание 2, Голоднюк Артем
a3 = {12, 32, 42, 52, 102}
a4 = set([12, 20, 32, 62, 102])
aall = a3.symmetric_difference(a4)
aall2 = a3.union(a4)
aall3 = a3.intersection(a4)
aall4 = a3.difference(a4)
print(aall, aall2, aall3, aall4)

# Лабораторная работа №7 задание 3, Голоднюк Артем
a5 = {1, 2, 3, 4, 5}
a6 = set([3, 4, 5, 6, 7])
print(a5 ^ a6)

# Лабораторная работа №7 задание 4, Голоднюк Артем
a7 = {1, 2, 3, 4, 5}
a8 = set([3, 4, 5, 6, 7])
print(a7 <= a8)

a9 = {1, 2, 3}
a10 = set([1, 2, 3, 4, 5])
print(a9 <= a10)